GopalSaraf/Practicals/PSDL/include/proc/pic18f16q40.inc
// Register: DAC2DATL
#define DAC2DATL DAC2DATL
DAC2DATL                                 equ 00A0h
// bitfield definitions
DAC2DATL_DAC2R_POSN                      equ 0000h
DAC2DATL_DAC2R_POSITION                  equ 0000h
DAC2DATL_DAC2R_SIZE                      equ 0008h
DAC2DATL_DAC2R_LENGTH                    equ 0008h
DAC2DATL_DAC2R_MASK                      equ 00FFh
DAC2DATL_DAC2R0_POSN                     equ 0000h
DAC2DATL_DAC2R0_POSITION                 equ 0000h
DAC2DATL_DAC2R0_SIZE                     equ 0001h
DAC2DATL_DAC2R0_LENGTH                   equ 0001h
DAC2DATL_DAC2R0_MASK                     equ 0001h
DAC2DATL_DAC2R1_POSN                     equ 0001h
DAC2DATL_DAC2R1_POSITION                 equ 0001h
DAC2DATL_DAC2R1_SIZE                     equ 0001h
DAC2DATL_DAC2R1_LENGTH                   equ 0001h
DAC2DATL_DAC2R1_MASK                     equ 0002h
DAC2DATL_DAC2R2_POSN                     equ 0002h
DAC2DATL_DAC2R2_POSITION                 equ 0002h
DAC2DATL_DAC2R2_SIZE                     equ 0001h
DAC2DATL_DAC2R2_LENGTH                   equ 0001h
DAC2DATL_DAC2R2_MASK                     equ 0004h
DAC2DATL_DAC2R3_POSN                     equ 0003h
DAC2DATL_DAC2R3_POSITION                 equ 0003h
DAC2DATL_DAC2R3_SIZE                     equ 0001h
DAC2DATL_DAC2R3_LENGTH                   equ 0001h
DAC2DATL_DAC2R3_MASK                     equ 0008h
DAC2DATL_DAC2R4_POSN                     equ 0004h
DAC2DATL_DAC2R4_POSITION                 equ 0004h
DAC2DATL_DAC2R4_SIZE                     equ 0001h
DAC2DATL_DAC2R4_LENGTH                   equ 0001h
DAC2DATL_DAC2R4_MASK                     equ 0010h
DAC2DATL_DAC2R5_POSN                     equ 0005h
DAC2DATL_DAC2R5_POSITION                 equ 0005h
DAC2DATL_DAC2R5_SIZE                     equ 0001h
DAC2DATL_DAC2R5_LENGTH                   equ 0001h
DAC2DATL_DAC2R5_MASK                     equ 0020h
DAC2DATL_DAC2R6_POSN                     equ 0006h
DAC2DATL_DAC2R6_POSITION                 equ 0006h
DAC2DATL_DAC2R6_SIZE                     equ 0001h
DAC2DATL_DAC2R6_LENGTH                   equ 0001h
DAC2DATL_DAC2R6_MASK                     equ 0040h
DAC2DATL_DAC2R7_POSN                     equ 0007h
DAC2DATL_DAC2R7_POSITION                 equ 0007h
DAC2DATL_DAC2R7_SIZE                     equ 0001h
DAC2DATL_DAC2R7_LENGTH                   equ 0001h
DAC2DATL_DAC2R7_MASK                     equ 0080h
DAC2DATL_DAC2RL_POSN                     equ 0000h
DAC2DATL_DAC2RL_POSITION                 equ 0000h
DAC2DATL_DAC2RL_SIZE                     equ 0008h
DAC2DATL_DAC2RL_LENGTH                   equ 0008h
DAC2DATL_DAC2RL_MASK                     equ 00FFh

// Register: DAC2CON
#define DAC2CON DAC2CON
DAC2CON                                  equ 00A2h
// bitfield definitions
DAC2CON_NSS_POSN                         equ 0000h
DAC2CON_NSS_POSITION                     equ 0000h
DAC2CON_NSS_SIZE                         equ 0002h
DAC2CON_NSS_LENGTH                       equ 0002h
DAC2CON_NSS_MASK                         equ 0003h
DAC2CON_PSS_POSN                         equ 0002h
DAC2CON_PSS_POSITION                     equ 0002h
DAC2CON_PSS_SIZE                         equ 0002h
DAC2CON_PSS_LENGTH                       equ 0002h
DAC2CON_PSS_MASK                         equ 000Ch
DAC2CON_EN_POSN                          equ 0007h
DAC2CON_EN_POSITION                      equ 0007h
DAC2CON_EN_SIZE                          equ 0001h
DAC2CON_EN_LENGTH                        equ 0001h
DAC2CON_EN_MASK                          equ 0080h
DAC2CON_DAC2NSS_POSN                     equ 0000h
DAC2CON_DAC2NSS_POSITION                 equ 0000h
DAC2CON_DAC2NSS_SIZE                     equ 0002h
DAC2CON_DAC2NSS_LENGTH                   equ 0002h
DAC2CON_DAC2NSS_MASK                     equ 0003h
DAC2CON_DAC2PSS0_POSN                    equ 0002h
DAC2CON_DAC2PSS0_POSITION                equ 0002h
DAC2CON_DAC2PSS0_SIZE                    equ 0001h
DAC2CON_DAC2PSS0_LENGTH                  equ 0001h
DAC2CON_DAC2PSS0_MASK                    equ 0004h
DAC2CON_DAC2PSS1_POSN                    equ 0003h
DAC2CON_DAC2PSS1_POSITION                equ 0003h
DAC2CON_DAC2PSS1_SIZE                    equ 0001h
DAC2CON_DAC2PSS1_LENGTH                  equ 0001h
DAC2CON_DAC2PSS1_MASK                    equ 0008h
DAC2CON_DAC2EN_POSN                      equ 0007h
DAC2CON_DAC2EN_POSITION                  equ 0007h
DAC2CON_DAC2EN_SIZE                      equ 0001h
DAC2CON_DAC2EN_LENGTH                    equ 0001h
DAC2CON_DAC2EN_MASK                      equ 0080h
DAC2CON_NSS0_POSN                        equ 0000h
DAC2CON_NSS0_POSITION                    equ 0000h
DAC2CON_NSS0_SIZE                        equ 0001h
DAC2CON_NSS0_LENGTH                      equ 0001h
DAC2CON_NSS0_MASK                        equ 0001h
DAC2CON_PSS0_POSN                        equ 0002h
DAC2CON_PSS0_POSITION                    equ 0002h
DAC2CON_PSS0_SIZE                        equ 0001h
DAC2CON_PSS0_LENGTH                      equ 0001h
DAC2CON_PSS0_MASK                        equ 0004h
DAC2CON_PSS1_POSN                        equ 0003h
DAC2CON_PSS1_POSITION                    equ 0003h
DAC2CON_PSS1_SIZE                        equ 0001h
DAC2CON_PSS1_LENGTH                      equ 0001h
DAC2CON_PSS1_MASK                        equ 0008h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 00ACh
// bitfield definitions
ACTCON_ORS_POSN                          equ 0001h
ACTCON_ORS_POSITION                      equ 0001h
ACTCON_ORS_SIZE                          equ 0001h
ACTCON_ORS_LENGTH                        equ 0001h
ACTCON_ORS_MASK                          equ 0002h
ACTCON_LOCK_POSN                         equ 0003h
ACTCON_LOCK_POSITION                     equ 0003h
ACTCON_LOCK_SIZE                         equ 0001h
ACTCON_LOCK_LENGTH                       equ 0001h
ACTCON_LOCK_MASK                         equ 0008h
ACTCON_UD_POSN                           equ 0006h
ACTCON_UD_POSITION                       equ 0006h
ACTCON_UD_SIZE                           equ 0001h
ACTCON_UD_LENGTH                         equ 0001h
ACTCON_UD_MASK                           equ 0040h
ACTCON_EN_POSN                           equ 0007h
ACTCON_EN_POSITION                       equ 0007h
ACTCON_EN_SIZE                           equ 0001h
ACTCON_EN_LENGTH                         equ 0001h
ACTCON_EN_MASK                           equ 0080h
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTUD_POSN                        equ 0006h
ACTCON_ACTUD_POSITION                    equ 0006h
ACTCON_ACTUD_SIZE                        equ 0001h
ACTCON_ACTUD_LENGTH                      equ 0001h
ACTCON_ACTUD_MASK                        equ 0040h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h

// Register: OSCCON1
#define OSCCON1 OSCCON1
OSCCON1                                  equ 00ADh
// bitfield definitions
OSCCON1_NDIV_POSN                        equ 0000h
OSCCON1_NDIV_POSITION                    equ 0000h
OSCCON1_NDIV_SIZE                        equ 0004h
OSCCON1_NDIV_LENGTH                      equ 0004h
OSCCON1_NDIV_MASK                        equ 000Fh
OSCCON1_NOSC_POSN                        equ 0004h
OSCCON1_NOSC_POSITION                    equ 0004h
OSCCON1_NOSC_SIZE                        equ 0003h
OSCCON1_NOSC_LENGTH                      equ 0003h
OSCCON1_NOSC_MASK                        equ 0070h
OSCCON1_NDIV0_POSN                       equ 0000h
OSCCON1_NDIV0_POSITION                   equ 0000h
OSCCON1_NDIV0_SIZE                       equ 0001h
OSCCON1_NDIV0_LENGTH                     equ 0001h
OSCCON1_NDIV0_MASK                       equ 0001h
OSCCON1_NDIV1_POSN                       equ 0001h
OSCCON1_NDIV1_POSITION                   equ 0001h
OSCCON1_NDIV1_SIZE                       equ 0001h
OSCCON1_NDIV1_LENGTH                     equ 0001h
OSCCON1_NDIV1_MASK                       equ 0002h
OSCCON1_NDIV2_POSN                       equ 0002h
OSCCON1_NDIV2_POSITION                   equ 0002h
OSCCON1_NDIV2_SIZE                       equ 0001h
OSCCON1_NDIV2_LENGTH                     equ 0001h
OSCCON1_NDIV2_MASK                       equ 0004h
OSCCON1_NDIV3_POSN                       equ 0003h
OSCCON1_NDIV3_POSITION                   equ 0003h
OSCCON1_NDIV3_SIZE                       equ 0001h
OSCCON1_NDIV3_LENGTH                     equ 0001h
OSCCON1_NDIV3_MASK                       equ 0008h
OSCCON1_NOSC0_POSN                       equ 0004h
OSCCON1_NOSC0_POSITION                   equ 0004h
OSCCON1_NOSC0_SIZE                       equ 0001h
OSCCON1_NOSC0_LENGTH                     equ 0001h
OSCCON1_NOSC0_MASK                       equ 0010h
OSCCON1_NOSC1_POSN                       equ 0005h
OSCCON1_NOSC1_POSITION                   equ 0005h
OSCCON1_NOSC1_SIZE                       equ 0001h
OSCCON1_NOSC1_LENGTH                     equ 0001h
OSCCON1_NOSC1_MASK                       equ 0020h
OSCCON1_NOSC2_POSN                       equ 0006h
OSCCON1_NOSC2_POSITION                   equ 0006h
OSCCON1_NOSC2_SIZE                       equ 0001h
OSCCON1_NOSC2_LENGTH                     equ 0001h
OSCCON1_NOSC2_MASK                       equ 0040h

// Register: OSCCON2
#define OSCCON2 OSCCON2
OSCCON2                                  equ 00AEh
// bitfield definitions
OSCCON2_CDIV_POSN                        equ 0000h
OSCCON2_CDIV_POSITION                    equ 0000h
OSCCON2_CDIV_SIZE                        equ 0004h
OSCCON2_CDIV_LENGTH                      equ 0004h
OSCCON2_CDIV_MASK                        equ 000Fh
OSCCON2_COSC_POSN                        equ 0004h
OSCCON2_COSC_POSITION                    equ 0004h
OSCCON2_COSC_SIZE                        equ 0003h
OSCCON2_COSC_LENGTH                      equ 0003h
OSCCON2_COSC_MASK                        equ 0070h
OSCCON2_CDIV0_POSN                       equ 0000h
OSCCON2_CDIV0_POSITION                   equ 0000h
OSCCON2_CDIV0_SIZE                       equ 0001h
OSCCON2_CDIV0_LENGTH                     equ 0001h
OSCCON2_CDIV0_MASK                       equ 0001h
OSCCON2_CDIV1_POSN                       equ 0001h
OSCCON2_CDIV1_POSITION                   equ 0001h
OSCCON2_CDIV1_SIZE                       equ 0001h
OSCCON2_CDIV1_LENGTH                     equ 0001h
OSCCON2_CDIV1_MASK                       equ 0002h
OSCCON2_CDIV2_POSN                       equ 0002h
OSCCON2_CDIV2_POSITION                   equ 0002h
OSCCON2_CDIV2_SIZE                       equ 0001h
OSCCON2_CDIV2_LENGTH                     equ 0001h
OSCCON2_CDIV2_MASK                       equ 0004h
OSCCON2_CDIV3_POSN                       equ 0003h
OSCCON2_CDIV3_POSITION                   equ 0003h
OSCCON2_CDIV3_SIZE                       equ 0001h
OSCCON2_CDIV3_LENGTH                     equ 0001h
OSCCON2_CDIV3_MASK                       equ 0008h
OSCCON2_COSC0_POSN                       equ 0004h
OSCCON2_COSC0_POSITION                   equ 0004h
OSCCON2_COSC0_SIZE                       equ 0001h
OSCCON2_COSC0_LENGTH                     equ 0001h
OSCCON2_COSC0_MASK                       equ 0010h
OSCCON2_COSC1_POSN                       equ 0005h
OSCCON2_COSC1_POSITION                   equ 0005h
OSCCON2_COSC1_SIZE                       equ 0001h
OSCCON2_COSC1_LENGTH                     equ 0001h
OSCCON2_COSC1_MASK                       equ 0020h
OSCCON2_COSC2_POSN                       equ 0006h
OSCCON2_COSC2_POSITION                   equ 0006h
OSCCON2_COSC2_SIZE                       equ 0001h
OSCCON2_COSC2_LENGTH                     equ 0001h
OSCCON2_COSC2_MASK                       equ 0040h

// Register: OSCCON3
#define OSCCON3 OSCCON3
OSCCON3                                  equ 00AFh
// bitfield definitions
OSCCON3_NOSCR_POSN                       equ 0003h
OSCCON3_NOSCR_POSITION                   equ 0003h
OSCCON3_NOSCR_SIZE                       equ 0001h
OSCCON3_NOSCR_LENGTH                     equ 0001h
OSCCON3_NOSCR_MASK                       equ 0008h
OSCCON3_ORDY_POSN                        equ 0004h
OSCCON3_ORDY_POSITION                    equ 0004h
OSCCON3_ORDY_SIZE                        equ 0001h
OSCCON3_ORDY_LENGTH                      equ 0001h
OSCCON3_ORDY_MASK                        equ 0010h
OSCCON3_SOSCPWR_POSN                     equ 0006h
OSCCON3_SOSCPWR_POSITION                 equ 0006h
OSCCON3_SOSCPWR_SIZE                     equ 0001h
OSCCON3_SOSCPWR_LENGTH                   equ 0001h
OSCCON3_SOSCPWR_MASK                     equ 0040h
OSCCON3_CSWHOLD_POSN                     equ 0007h
OSCCON3_CSWHOLD_POSITION                 equ 0007h
OSCCON3_CSWHOLD_SIZE                     equ 0001h
OSCCON3_CSWHOLD_LENGTH                   equ 0001h
OSCCON3_CSWHOLD_MASK                     equ 0080h

