GopalSaraf/Practicals/PSDL/include/proc/pic18f16q40.inc
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE8), 7, a
#define SCANIF                           BANKMASK(PIR8), 7, a
#define SCANIP                           BANKMASK(IPR8), 7, b
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANPR0                          BANKMASK(SCANPR), 0, b
#define SCANPR1                          BANKMASK(SCANPR), 1, b
#define SCANPR2                          BANKMASK(SCANPR), 2, b
#define SCIE                             BANKMASK(I2C1PIE), 0, b
#define SCIF                             BANKMASK(I2C1PIR), 0, b
#define SCNT0                            BANKMASK(DMAnSCNTL), 0, b
#define SCNT1                            BANKMASK(DMAnSCNTL), 1, b
#define SCNT10                           BANKMASK(DMAnSCNTH), 2, b
#define SCNT11                           BANKMASK(DMAnSCNTH), 3, b
#define SCNT2                            BANKMASK(DMAnSCNTL), 2, b
#define SCNT3                            BANKMASK(DMAnSCNTL), 3, b
#define SCNT4                            BANKMASK(DMAnSCNTL), 4, b
#define SCNT5                            BANKMASK(DMAnSCNTL), 5, b
#define SCNT6                            BANKMASK(DMAnSCNTL), 6, b
#define SCNT7                            BANKMASK(DMAnSCNTL), 7, b
#define SCNT8                            BANKMASK(DMAnSCNTH), 0, b
#define SCNT9                            BANKMASK(DMAnSCNTH), 1, b
#define SDAHT0                           BANKMASK(I2C1CON2), 2, b
#define SDAHT1                           BANKMASK(I2C1CON2), 3, b
#define SEL0                             BANKMASK(HLVDCON1), 0, b
#define SEL1                             BANKMASK(HLVDCON1), 1, b
#define SEL2                             BANKMASK(HLVDCON1), 2, b
#define SEL3                             BANKMASK(HLVDCON1), 3, b
#define SETUP0                           BANKMASK(CRCCON0), 2, b
#define SETUP1                           BANKMASK(CRCCON0), 3, b
#define SGO                              BANKMASK(SCANCON0), 5, b
#define SHADLO                           BANKMASK(SHADCON), 0, b
#define SHIFT0                           BANKMASK(CRCSHFTL), 0, b
#define SHIFT1                           BANKMASK(CRCSHFTL), 1, b
#define SHIFT10                          BANKMASK(CRCSHFTH), 2, b
#define SHIFT11                          BANKMASK(CRCSHFTH), 3, b
#define SHIFT12                          BANKMASK(CRCSHFTH), 4, b
#define SHIFT13                          BANKMASK(CRCSHFTH), 5, b
#define SHIFT14                          BANKMASK(CRCSHFTH), 6, b
#define SHIFT15                          BANKMASK(CRCSHFTH), 7, b
#define SHIFT16                          BANKMASK(CRCSHFTU), 0, b
#define SHIFT17                          BANKMASK(CRCSHFTU), 1, b
#define SHIFT18                          BANKMASK(CRCSHFTU), 2, b
#define SHIFT19                          BANKMASK(CRCSHFTU), 3, b
#define SHIFT2                           BANKMASK(CRCSHFTL), 2, b
#define SHIFT20                          BANKMASK(CRCSHFTU), 4, b
#define SHIFT21                          BANKMASK(CRCSHFTU), 5, b
#define SHIFT22                          BANKMASK(CRCSHFTU), 6, b
#define SHIFT23                          BANKMASK(CRCSHFTU), 7, b
#define SHIFT24                          BANKMASK(CRCSHFTT), 0, b
#define SHIFT25                          BANKMASK(CRCSHFTT), 1, b
#define SHIFT26                          BANKMASK(CRCSHFTT), 2, b
#define SHIFT27                          BANKMASK(CRCSHFTT), 3, b
#define SHIFT28                          BANKMASK(CRCSHFTT), 4, b
#define SHIFT29                          BANKMASK(CRCSHFTT), 5, b
#define SHIFT3                           BANKMASK(CRCSHFTL), 3, b
#define SHIFT30                          BANKMASK(CRCSHFTT), 6, b
#define SHIFT31                          BANKMASK(CRCSHFTT), 7, b
#define SHIFT4                           BANKMASK(CRCSHFTL), 4, b
#define SHIFT5                           BANKMASK(CRCSHFTL), 5, b
#define SHIFT6                           BANKMASK(CRCSHFTL), 6, b
#define SHIFT7                           BANKMASK(CRCSHFTL), 7, b
#define SHIFT8                           BANKMASK(CRCSHFTH), 0, b
#define SHIFT9                           BANKMASK(CRCSHFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SIRQ0                            BANKMASK(DMAnSIRQ), 0, b
#define SIRQ1                            BANKMASK(DMAnSIRQ), 1, b
#define SIRQ2                            BANKMASK(DMAnSIRQ), 2, b
#define SIRQ3                            BANKMASK(DMAnSIRQ), 3, b
#define SIRQ4                            BANKMASK(DMAnSIRQ), 4, b
#define SIRQ5                            BANKMASK(DMAnSIRQ), 5, b
#define SIRQ6                            BANKMASK(DMAnSIRQ), 6, b
#define SIRQEN                           BANKMASK(DMAnCON0), 6, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SMA                              BANKMASK(I2C1STAT0), 6, b
#define SMT1AS                           BANKMASK(SMT1STAT), 0, b
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0, b
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1, b
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2, b
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3, b
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4, b
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5, b
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6, b
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7, b
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0, b
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1, b
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2, b
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3, b
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2, b
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4, b
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5, b
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6, b
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7, b
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3, b
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4, b
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5, b
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6, b
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7, b
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0, b
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1, b
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7, b
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0, b
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1, b
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2, b
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3, b
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4, b
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5, b
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6, b
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7, b
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0, b
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1, b
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2, b
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3, b
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2, b
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4, b
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5, b
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6, b
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7, b
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3, b
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4, b
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5, b
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6, b
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7, b
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0, b
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1, b
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6, b
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0, b
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1, b
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2, b
#define SMT1CSEL3                        BANKMASK(SMT1CLK), 3, b
#define SMT1GO                           BANKMASK(SMT1CON1), 7, b
#define SMT1IE                           BANKMASK(PIE1), 5, a
#define SMT1IF                           BANKMASK(PIR1), 5, a
#define SMT1IP                           BANKMASK(IPR1), 5, b
#define SMT1MD                           BANKMASK(PMD1), 5, b
#define SMT1MODE0                        BANKMASK(SMT1CON1), 0, b
#define SMT1MODE1                        BANKMASK(SMT1CON1), 1, b
#define SMT1MODE2                        BANKMASK(SMT1CON1), 2, b
#define SMT1MODE3                        BANKMASK(SMT1CON1), 3, b
#define SMT1PR0                          BANKMASK(SMT1PRL), 0, b
#define SMT1PR1                          BANKMASK(SMT1PRL), 1, b
#define SMT1PR10                         BANKMASK(SMT1PRH), 2, b
#define SMT1PR11                         BANKMASK(SMT1PRH), 3, b
#define SMT1PR12                         BANKMASK(SMT1PRH), 4, b
#define SMT1PR13                         BANKMASK(SMT1PRH), 5, b
#define SMT1PR14                         BANKMASK(SMT1PRH), 6, b
#define SMT1PR15                         BANKMASK(SMT1PRH), 7, b
#define SMT1PR16                         BANKMASK(SMT1PRU), 0, b
#define SMT1PR17                         BANKMASK(SMT1PRU), 1, b
#define SMT1PR18                         BANKMASK(SMT1PRU), 2, b
#define SMT1PR19                         BANKMASK(SMT1PRU), 3, b
#define SMT1PR2                          BANKMASK(SMT1PRL), 2, b
#define SMT1PR20                         BANKMASK(SMT1PRU), 4, b
#define SMT1PR21                         BANKMASK(SMT1PRU), 5, b
#define SMT1PR22                         BANKMASK(SMT1PRU), 6, b
#define SMT1PR23                         BANKMASK(SMT1PRU), 7, b
#define SMT1PR3                          BANKMASK(SMT1PRL), 3, b
#define SMT1PR4                          BANKMASK(SMT1PRL), 4, b
#define SMT1PR5                          BANKMASK(SMT1PRL), 5, b
#define SMT1PR6                          BANKMASK(SMT1PRL), 6, b
#define SMT1PR7                          BANKMASK(SMT1PRL), 7, b
#define SMT1PR8                          BANKMASK(SMT1PRH), 0, b
#define SMT1PR9                          BANKMASK(SMT1PRH), 1, b
#define SMT1PRAIE                        BANKMASK(PIE1), 6, a
#define SMT1PRAIF                        BANKMASK(PIR1), 6, a
#define SMT1PRAIP                        BANKMASK(IPR1), 6, b
#define SMT1PS0                          BANKMASK(SMT1CON0), 0, b
#define SMT1PS1                          BANKMASK(SMT1CON0), 1, b
#define SMT1PWAIE                        BANKMASK(PIE1), 7, a
#define SMT1PWAIF                        BANKMASK(PIR1), 7, a
#define SMT1PWAIP                        BANKMASK(IPR1), 7, b
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6, b
#define SMT1RESET                        BANKMASK(SMT1STAT), 5, b
#define SMT1SIGPPS0                      BANKMASK(SMT1SIGPPS), 0, b
#define SMT1SIGPPS1                      BANKMASK(SMT1SIGPPS), 1, b
#define SMT1SIGPPS2                      BANKMASK(SMT1SIGPPS), 2, b
#define SMT1SIGPPS3                      BANKMASK(SMT1SIGPPS), 3, b
#define SMT1SIGPPS4                      BANKMASK(SMT1SIGPPS), 4, b
#define SMT1SIGPPS5                      BANKMASK(SMT1SIGPPS), 5, b
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0, b
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1, b
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2, b
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3, b
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4, b
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0, b
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1, b
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2, b
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3, b
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4, b
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5, b
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6, b
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7, b
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0, b
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1, b
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2, b
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3, b
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2, b
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4, b
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5, b
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6, b
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7, b
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3, b
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4, b
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5, b
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6, b
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7, b
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0, b
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1, b
#define SMT1TS                           BANKMASK(SMT1STAT), 2, b
#define SMT1WINPPS0                      BANKMASK(SMT1WINPPS), 0, b
#define SMT1WINPPS1                      BANKMASK(SMT1WINPPS), 1, b
#define SMT1WINPPS2                      BANKMASK(SMT1WINPPS), 2, b
#define SMT1WINPPS3                      BANKMASK(SMT1WINPPS), 3, b
#define SMT1WINPPS4                      BANKMASK(SMT1WINPPS), 4, b
#define SMT1WINPPS5                      BANKMASK(SMT1WINPPS), 5, b
#define SMT1WS                           BANKMASK(SMT1STAT), 1, b
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0, b
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1, b
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2, b
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3, b
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SP5                              BANKMASK(STKPTR), 5, a
#define SP6                              BANKMASK(STKPTR), 6, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE3), 2, a
#define SPI1IF                           BANKMASK(PIR3), 2, a
#define SPI1IP                           BANKMASK(IPR3), 2, b
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD3), 4, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE3), 0, a
#define SPI1RXIF                         BANKMASK(PIR3), 0, a
#define SPI1RXIP                         BANKMASK(IPR3), 0, b
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SCKPPS0                      BANKMASK(SPI1SCKPPS), 0, b
#define SPI1SCKPPS1                      BANKMASK(SPI1SCKPPS), 1, b
#define SPI1SCKPPS2                      BANKMASK(SPI1SCKPPS), 2, b
#define SPI1SCKPPS3                      BANKMASK(SPI1SCKPPS), 3, b
#define SPI1SCKPPS4                      BANKMASK(SPI1SCKPPS), 4, b
#define SPI1SCKPPS5                      BANKMASK(SPI1SCKPPS), 5, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDIPPS0                      BANKMASK(SPI1SDIPPS), 0, b
#define SPI1SDIPPS1                      BANKMASK(SPI1SDIPPS), 1, b
#define SPI1SDIPPS2                      BANKMASK(SPI1SDIPPS), 2, b
#define SPI1SDIPPS3                      BANKMASK(SPI1SDIPPS), 3, b
#define SPI1SDIPPS4                      BANKMASK(SPI1SDIPPS), 4, b
#define SPI1SDIPPS5                      BANKMASK(SPI1SDIPPS), 5, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1SSPPS0                       BANKMASK(SPI1SSPPS), 0, b
#define SPI1SSPPS1                       BANKMASK(SPI1SSPPS), 1, b
#define SPI1SSPPS2                       BANKMASK(SPI1SSPPS), 2, b
#define SPI1SSPPS3                       BANKMASK(SPI1SSPPS), 3, b
#define SPI1SSPPS4                       BANKMASK(SPI1SSPPS), 4, b
#define SPI1SSPPS5                       BANKMASK(SPI1SSPPS), 5, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE3), 1, a
#define SPI1TXIF                         BANKMASK(PIR3), 1, a
#define SPI1TXIP                         BANKMASK(IPR3), 1, b
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPI2BMODE                        BANKMASK(SPI2CON0), 0, b
#define SPI2BUSY                         BANKMASK(SPI2CON2), 7, b
#define SPI2CKE                          BANKMASK(SPI2CON1), 6, b
#define SPI2CKP                          BANKMASK(SPI2CON1), 5, b
#define SPI2CLKSEL0                      BANKMASK(SPI2CLK), 0, b
#define SPI2CLKSEL1                      BANKMASK(SPI2CLK), 1, b
#define SPI2CLKSEL2                      BANKMASK(SPI2CLK), 2, b
#define SPI2CLKSEL3                      BANKMASK(SPI2CLK), 3, b
#define SPI2CLRBF                        BANKMASK(SPI2STATUS), 2, b
#define SPI2EOSIE                        BANKMASK(SPI2INTE), 4, b
#define SPI2EOSIF                        BANKMASK(SPI2INTF), 4, b
#define SPI2FST                          BANKMASK(SPI2CON1), 4, b
#define SPI2IE                           BANKMASK(PIE5), 2, a
#define SPI2IF                           BANKMASK(PIR5), 2, a
#define SPI2IP                           BANKMASK(IPR5), 2, b
#define SPI2LSBF                         BANKMASK(SPI2CON0), 2, b
#define SPI2MD                           BANKMASK(PMD3), 5, b
#define SPI2MST                          BANKMASK(SPI2CON0), 1, b
#define SPI2RXBF                         BANKMASK(SPI2STATUS), 0, b
#define SPI2RXIE                         BANKMASK(PIE5), 0, a
#define SPI2RXIF                         BANKMASK(PIR5), 0, a
#define SPI2RXIP                         BANKMASK(IPR5), 0, b
#define SPI2RXOIE                        BANKMASK(SPI2INTE), 2, b
#define SPI2RXOIF                        BANKMASK(SPI2INTF), 2, b
#define SPI2RXR                          BANKMASK(SPI2CON2), 0, b
#define SPI2RXRE                         BANKMASK(SPI2STATUS), 3, b
